// Массив имён

const NAMES_ARRAY = [
  'Антуан',
  'Роджер',
  'Рошан',
  'Максимильян',
  'Хачатурян',
  'Вазовски',
];

// Массив сообщений

const MESSAGE_ARRAY = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

//   Массив Фотокарточек

const DESCRIPTION_ARRAY = [
  'Кекстаграммная котейка',
  'Блудливый котян',
  'Ночной пуритан',
  'Предсказуемый жрец',
  'Развратный жмурик',
  'Неистовый фрик',
  'Печальный брокер',
  'Условный знак',
];

// Параметры для функции возврата случайных чисел

const MIN_RANDOM_ID = 1;
const MAX_RANDOM_ID = 6;

// Переменные для получения случайного числа

const MIN_LIKE = 0;
const MAX_LIKE_COUNT = 2000;

// Параметры для функции возврата фотокарточки

const MAX_PHOTOCARD_AMOUNT = 25;

export {
  NAMES_ARRAY,
  MESSAGE_ARRAY,
  DESCRIPTION_ARRAY,
  MIN_RANDOM_ID,
  MAX_RANDOM_ID,
  MIN_LIKE,
  MAX_LIKE_COUNT,
  MAX_PHOTOCARD_AMOUNT
};
