// 1 Загрузка изображения и заполнение информации о нем
// - Выбор файла для загрузки;
// - Изменение его масштаба;
// - Применение эффектов;
// - Выбор глубины эффекта с помощью ползунка;
// - Добавление текстового комментария;
// - Добавление хэштегов;
// Загрузка реальной фотографии опционально

// 1.2 Контрол загрузки файла #upload-file
// - изменение значения поля контрола. Показывается форма редактирования изображения;
// - Удалить класс .hidden у элемента .img-upload__overlay;
// - Задать класс .modal-open элементу body;

// 1.3 Закрытие формы редактирования
// - Закрыть форму с помощью #upload-cancel либо кнопкой ESC;
// - Вернуть элементу .img-upload__overlay класс .hidden;
// - Элементу body удалить класс .modal-open;

// 2 РЕДАКТИРОВАНИЕ ФАЙЛА d
